In [ ]:
PANDAS 

DATA CLEANING and PREPARATION
BUILTIN VISUALIZATION
can work with WIDE VARIETY OF DATASET

SERIES DATATYPES in pandas

We can use labels as index unlike the numpy,Series provides the flexibility of holding any datatype with indexing and also built in functions,for  example

In [2]:
import numpy as np
import pandas as pd

In [3]:
value = ['a','b','c']
numbers = [11,22,33]
dictionary = {'v':10,'d': 20,'c':30}
arr = np.array(value)

Use PD.SERIES TO CREATE SERIES

Click on pd.series() and press shift+tab to see the various data fields in the series

SELECTION AND INDEXING

In [4]:
pd.Series(value)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data =value, index = numbers)

11    a
22    b
33    c
dtype: object

we can use the labels to call the datapoints

We can also use pd.Series(value,numbers) which is same as long as we follow the documentation of the datafields

we can also use 'arrays' for labeling in series

In [6]:
 arr

array(['a', 'b', 'c'], dtype='<U1')

In [7]:
pd.Series(arr,numbers)

11    a
22    b
33    c
dtype: object

In [8]:
pd.Series(dictionary)

v    10
d    20
c    30
dtype: int64

We can use built in fuctions in series

In [9]:
  pd.Series(data = sum(numbers))

0    66
dtype: int64

In [10]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
pd.Series(data=[sum(numbers),print(dictionary),len(value)])

{'v': 10, 'd': 20, 'c': 30}

0    66.0
1     NaN
2     3.0
dtype: float64

Lets see real time use of series and how to grab data from series

SERIES are very useful in grabbing data like NUMPY and perform basic operation as well

In [12]:
Series1 = pd.Series([1,2,3,4],['india','italy','china','pakistan'])

In [13]:
Series2 = pd.Series([1,2,3,4],['india','italy','korea','pakistan'])

In [14]:
Series1['india']

1

In [15]:
Series2[2]

3

In [16]:
Series1

india       1
italy       2
china       3
pakistan    4
dtype: int64

In [17]:
Series2

india       1
italy       2
korea       3
pakistan    4
dtype: int64

In [18]:
Series1 + Series2

china       NaN
india       2.0
italy       4.0
korea       NaN
pakistan    8.0
dtype: float64

In [19]:
Series1 / Series2

china       NaN
india       1.0
italy       1.0
korea       NaN
pakistan    1.0
dtype: float64

DATAFRAMES

Dataframe is same as series but with multiple columns for same index

In [20]:
from numpy.random import randn

In [21]:
np.random.seed(101)

In [22]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [23]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

WE CAN ADD NEW COLUMNS WITH SOME OPERATIONS

In [24]:
df['new'] = df['w'] + df['y']

In [25]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df.drop('new',axis = 1,inplace = False)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

INPLACE specifies it should be reflected on data permanently, axis = 0 (row) ,1 (column)

In [27]:
df.shape

(5, 5)

COLUMN WISE ACCESS

each columns are also series

In [28]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [29]:
df.w

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

using df.w is not recommended as there are many builtin functions which might cause confusion,
[] are recommended

In [30]:
df[['w','x']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

In [31]:
df['w']['a']

2.706849839399938

ROW WISE ACCESS

There are two methods LOC for 'LABEL BASED INDEX' and ILOC for 'INTEGER BASED INDEX', rows are also series like columns

In [32]:
df.loc['c']

w     -2.018168
x      0.740122
y      0.528813
z     -0.589001
new   -1.489355
Name: c, dtype: float64

In [33]:
df.iloc[2]

w     -2.018168
x      0.740122
y      0.528813
z     -0.589001
new   -1.489355
Name: c, dtype: float64

for subsets of dataset

In [34]:
df.loc[['a','b','d'],['w','x']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
d  0.188695 -0.758872

CONDITIONAL SELECTIION

In [35]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [36]:
df>0

       w      x      y      z    new
a   True   True   True   True   True
b   True  False  False   True  False
c  False   True   True  False  False
d   True  False  False   True  False
e   True   True   True   True   True

we can use the condition and display values which satisfies

In [37]:
df[df>0]

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118       NaN       NaN  0.605965       NaN
c       NaN  0.740122  0.528813       NaN       NaN
d  0.188695       NaN       NaN  0.955057       NaN
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [38]:
df[df['w']>0]

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

CREATING DATAFRAME WITHOUT LABEL

In [39]:
dw = pd.DataFrame(randn(3,2),index= None,columns=('a','b'))

In [40]:
dw

          a         b
0  0.302665  1.693723
1 -1.706086 -1.159119
2 -0.134841  0.390528

we can perform the conditional operations in the columns,df['w']>0 returns the rows of the column 'w' that satisfies the conditio

In [41]:
df[df['w']>0]

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [42]:
df[df['w']>0]['y']

a    0.907969
b   -0.848077
d   -0.933237
e    2.605967
Name: y, dtype: float64

In [43]:
df[df['x']>0][['y','z','w']]

          y         z         w
a  0.907969  0.503826  2.706850
c  0.528813 -0.589001 -2.018168
e  2.605967  0.683509  0.190794

For two conditions you can use | and & with parenthesis, AND and OR cannot be used here since it is a series of data

In [44]:
df[(df['x']>0) | (df['y']>1)]

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
e  0.190794  1.978757  2.605967  0.683509  2.796762

we can change the index labels or make one of the column values as index RESET_INDEX, SET_INDEX

In [45]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

reset the index values to 0 to n

In [46]:
df.reset_index()

  index         w         x         y         z       new
0     a  2.706850  0.628133  0.907969  0.503826  3.614819
1     b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     c -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     e  0.190794  1.978757  2.605967  0.683509  2.796762

In [47]:
pn_code = 'CH KL KA AP PD'.split()

In [48]:
pn_code

['CH', 'KL', 'KA', 'AP', 'PD']

In [49]:
df['province'] = pn_code

In [50]:
df

          w         x         y         z       new province
a  2.706850  0.628133  0.907969  0.503826  3.614819       CH
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959       KL
c -2.018168  0.740122  0.528813 -0.589001 -1.489355       KA
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542       AP
e  0.190794  1.978757  2.605967  0.683509  2.796762       PD

In [51]:
df.set_index('province')

                 w         x         y         z       new
province
CH        2.706850  0.628133  0.907969  0.503826  3.614819
KL        0.651118 -0.319318 -0.848077  0.605965 -0.196959
KA       -2.018168  0.740122  0.528813 -0.589001 -1.489355
AP        0.188695 -0.758872 -0.933237  0.955057 -0.744542
PD        0.190794  1.978757  2.605967  0.683509  2.796762

MULTI INDEX TOPIC AND INDEX HIGHER KEY TOPIC

In [52]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

LIST(ZIP(VARIABLE,VARIABLE)) is used to provide a tuple pair of list

In [53]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [54]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [56]:
dm = pd.DataFrame(randn(6,2),index =hier_index, columns = ['A','B'] )

In [57]:
dm

             A         B
G1 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646
G2 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755

In [58]:
dm.loc[ 'G1']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [59]:
dm.loc['G1'].iloc[1]

A    0.807706
B    0.072960
Name: 2, dtype: float64

we cn add the names of the index fro (G1,G2) and (1,2,3)

In [60]:
dm.index.names

FrozenList([None, None])

In [61]:
dm.index.names = ['Groups','members']

In [62]:
dm

                       A         B
Groups members
G1     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646
G2     1       -0.497104 -0.754070
       2       -0.943406  0.484752
       3       -0.116773  1.901755

CROSS SECTION METHOD

To access the member (1) in both groups, it might be tricky for loc method, this is where the cross section methods come(XS)

In [63]:
dm

                       A         B
Groups members
G1     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646
G2     1       -0.497104 -0.754070
       2       -0.943406  0.484752
       3       -0.116773  1.901755

In [64]:
dm.xs('G2')

                A         B
members
1       -0.497104 -0.754070
2       -0.943406  0.484752
3       -0.116773  1.901755

In [65]:
dm.xs(1,level = 'members')

               A         B
Groups
G1      0.166905  0.184502
G2     -0.497104 -0.754070

MISSING VALUES

we can either remove the values or fill the values

 REMOVE VALUES

In [66]:
RV = {'A':[1,2,3],'B':[5,np.nan,6],'C':[np.nan,np.nan,1]}

In [67]:
RV

{'A': [1, 2, 3], 'B': [5, nan, 6], 'C': [nan, nan, 1]}

In [68]:
RV = pd.DataFrame(RV)

In [69]:
RV

   A    B    C
0  1  5.0  NaN
1  2  NaN  NaN
2  3  6.0  1.0

DROPNA can used to remove the columns or rows with NULL VALUES

In [70]:
RV.dropna()

   A    B    C
2  3  6.0  1.0

In [71]:
RV.dropna(axis = 0)

   A    B    C
2  3  6.0  1.0

In [72]:
RV.dropna(axis = 1)

   A
0  1
1  2
2  3

we can make a threshold for the drop values using TRESHOLD

In [73]:
RV.dropna(thresh=1)

   A    B    C
0  1  5.0  NaN
1  2  NaN  NaN
2  3  6.0  1.0

thresh actually checks for number of non-na values present, (thresh = 1)there must be 1 non null values

In [74]:
RV.dropna(thresh = 2)

   A    B    C
0  1  5.0  NaN
2  3  6.0  1.0

FILLING VALUES

In [75]:
RV.fillna(value = 'FV')

   A   B   C
0  1   5  FV
1  2  FV  FV
2  3   6   1

we can also perform sum apreations and assign that value in that place

In [77]:
RV['B']

0    5.0
1    NaN
2    6.0
Name: B, dtype: float64

In [78]:
RV['B'].fillna(value = RV['B'].mean() )

0    5.0
1    5.5
2    6.0
Name: B, dtype: float64

GROUPBY

GROUPBY is used to display the common values, group rows together based off a column name

In [90]:
 values = {'Company':['FB','FB','FB','INST','INST','INST','SNAP','SNAP','SNAP'],
               'person':['A','B','C','D','E','f','g','h','i'],
               'Sales':[100,200,300,100,65,95,85,75,299]}

First create a data frame for the values and use GROUPBY() method with the column field to be grouped

In [107]:
values= pd.DataFrame( values)

In [108]:
values

  Company person  Sales
0      FB      A    100
1      FB      B    200
2      FB      C    300
3    INST      D    100
4    INST      E     65
5    INST      f     95
6    SNAP      g     85
7    SNAP      h     75
8    SNAP      i    299

In [105]:
by_comp = values.groupby('Company')

In [106]:
by_comp

Use the object and perform  the aggregrate function to that specific column

In [100]:
by_comp.mean()

              Sales
Company
FB       200.000000
INST      86.666667
SNAP     153.000000

In [101]:
by_comp.sum().loc['FB']

Sales    600
Name: FB, dtype: int64

we can use MAX and MIN to use return the largest and smallest alphabet values

In [112]:
values.groupby('Company').min()

        person  Sales
Company
FB           A    100
INST         D     65
SNAP         g     75

In [113]:
values.groupby('Company').max()

        person  Sales
Company
FB           C    300
INST         f    100
SNAP         i    299

In [114]:
values.groupby('Company').count()

         person  Sales
Company
FB            3      3
INST          3      3
SNAP          3      3

In [115]:
values.groupby('Company').describe()

        Sales
        count        mean         std    min    25%    50%    75%    max
Company
FB        3.0  200.000000  100.000000  100.0  150.0  200.0  250.0  300.0
INST      3.0   86.666667   18.929694   65.0   80.0   95.0   97.5  100.0
SNAP      3.0  153.000000  126.538532   75.0   80.0   85.0  192.0  299.0

In [117]:
values.groupby('Company').describe().transpose()

Company         FB        INST        SNAP
Sales count    3.0    3.000000    3.000000
      mean   200.0   86.666667  153.000000
      std    100.0   18.929694  126.538532
      min    100.0   65.000000   75.000000
      25%    150.0   80.000000   80.000000
      50%    200.0   95.000000   85.000000
      75%    250.0   97.500000  192.000000
      max    300.0  100.000000  299.000000

In [118]:
values.groupby('Company').describe().transpose()['FB']

Sales  count      3.0
       mean     200.0
       std      100.0
       min      100.0
       25%      150.0
       50%      200.0
       75%      250.0
       max      300.0
Name: FB, dtype: float64

JOINING,MERGING,CONCATENATING

In [ ]:
EXAMPLE DATA FRAME

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [4]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [5]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [ ]:
CONCATENATION

In [ ]:
there are 3 ways to combine the data. note the dimensions must be same to perform concatenation, Use CONCAT

In [6]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [7]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

EXAMPLE DATAFRAME

In [11]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
MERGE

Using merge we can merge two dataframe using certain conditions like HOW and ON, HOW describes whether to merge using inner,outer, left or right and ON is a key based on how merge should be performed

In [13]:
pd.merge(right, left,how = 'inner',on = 'key1')

  key1 key2_x   C   D key2_y   A   B
0   K0     K0  C0  D0     K0  A0  B0
1   K0     K0  C0  D0     K1  A1  B1
2   K1     K0  C1  D1     K0  A2  B2
3   K1     K0  C2  D2     K0  A2  B2
4   K2     K0  C3  D3     K1  A3  B3

In [14]:
pd.merge(left, right, how = 'inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [15]:
pd.merge(left, right, how = 'left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [16]:
pd.merge(left, right, how = 'right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

JOIN

join also performs similar data combining based on index,Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [20]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [21]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [22]:
left.join(right, how= 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

OPERATIONS

In [24]:
 do = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
do.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

INFO ON UNIQUE VALUES

To check the uniques values , use UNIQUE() which return  the values in numpy array, NUNIQUE() returns the count value of unique elements, we can also use LEN()

In [26]:
do['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [27]:
do['col1'].nunique()

4

In [28]:
len(do['col1'].unique())

4

In [45]:
do['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

SELECTING DATA

In [30]:
select = do[(do['col1']>2) & (do['col2']>445)]

In [31]:
select

   col1  col2 col3
2     3   666  ghi

In [ ]:
APPLYING FUNCTIONS

functions can be used in the dataframes using APPLY and both inbuilt and defined functions can be used

In [32]:
def mul(x):
    return x**2

In [39]:
do[[ 'col2','col1'] ].apply(mul)

     col2  col1
0  197136     1
1  308025     4
2  443556     9
3  197136    16

length of the string in the column value can be diplayed using len

In [41]:
do['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

we can also use lambda expression in the apply

In [50]:
do['col2'].apply(lambda x : x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

Sorting and Ordering a DataFrame:

In [51]:
do

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [52]:
do.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Check Null values

In [53]:
do.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [57]:
do.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Filling in NaN values with something else:

In [58]:
dn = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [59]:
dn

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [60]:
dn.fillna('fill')

   col1  col2 col3
0     1  fill  abc
1     2   555  def
2     3   666  ghi
3  fill   444  xyz

PIVOT TABLE

In [62]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

dp = pd.DataFrame(data)

In [63]:
dp

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [66]:
dp.pivot_table(values = 'D',index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [67]:
E = [1,1,3,3,5,4]

In [69]:
dp['E'] = E

In [70]:
dp

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  3
3  bar  two  y  5  3
4  bar  one  x  4  5
5  bar  one  y  1  4

In [72]:
dp.pivot_table(values = ['D','E'] ,index = ['A','B'],columns = ['C'])

           D         E
C          x    y    x    y
A   B
bar one  4.0  1.0  5.0  4.0
    two  NaN  5.0  NaN  3.0
foo one  1.0  3.0  1.0  1.0
    two  2.0  NaN  3.0  NaN

Data Input and Output

for getting input and output, pandas can read a variety of file types using its pd.read_ methods.kindly check the other formats as well

CSV

In [ ]:
df = pd.read_csv('filename.csv')

In [ ]:
df.to_csv('newfilename.csv', index = False)

to avoid a additional index for the csv format

EXCEL

In [ ]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [ ]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')